<?php
return [
    'login'           => 'ចូល',
    'add_member'      => '+ បន្ថែមសមាជិក',
    'remove'          => 'លុប',
    'submit'          => 'បញ្ជូន',
    'back'            => 'ត្រឡប់',
    'filter'          => 'តម្រង',
    'reset'           => 'កំណត់ឡើងវិញ',
    'export'          => 'នាំចេញ',
    'add'             => 'បន្ថែម',
    'edit'            => 'កែប្រែ',
    'show'            => 'បង្ហាញ',
    'delete'          => 'លុប',
    'reply'           => 'ឆ្លើយតប',
    'delete_confirm'  => 'តើអ្នកប្រាកដថាចង់លុបមែនទេ?',
];
