<?php

return [
    'show' => [
        'title' => '📋 ភារកិច្ចសម្រាប់ ":name"',
    ],

    'table' => [
        'task_name' => 'ឈ្មោះភារកិច្ច',
        'point'     => 'ពិន្ទុ',
        'action'    => 'សកម្មភាព',
    ],

    'form' => [
        'task_name'         => 'ឈ្មោះភារកិច្ច',
        'point'             => 'ពិន្ទុ',
        'placeholder_point' => '0',
    ],

    'create' => [
        'title' => 'បន្ថែមភារកិច្ចសម្រាប់ ":name"',
    ],

    'edit' => [
        'title' => 'កែសម្រួលភារកិច្ច ":name"',
    ],

    'controller' => [
        'create' => [
            'title'        => 'បន្ថែមភារកិច្ច | ផ្ទៃតាប្លូប្រចាំថ្ងៃ',
            'success_add'  => 'ភារកិច្ចត្រូវបានបន្ថែមដោយជោគជ័យ។',
        ],

        'edit' => [
            'title'          => 'កែសម្រួលភារកិច្ច | ផ្ទៃតាប្លូប្រចាំថ្ងៃ',
            'success_update' => 'ភារកិច្ចត្រូវបានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ។',
        ],

        'delete' => [
            'success_delete' => 'ភារកិច្ចត្រូវបានលុបដោយជោគជ័យ។',
        ],
    ],

    'validation' => [
        'required' => 'វាលនេះគឺជាចំបាច់។',
        'number'   => 'សូមបញ្ចូលលេខដែលត្រឹមត្រូវ។',
    ],
];