<?php

return [
    'index' => [
        'title' => 'ភារកិច្ចការិយាល័យ',
    ],

    'table' => [
        'name' => 'ឈ្មោះក្រុម',
        'status' => 'ស្ថានភាព',
        'action' => 'សកម្មភាព',
        'active' => 'សកម្ម',
        'inactive' => 'អសកម្ម',
        'show' => 'មើល',
        'edit' => 'កែប្រែ',
        'delete' => 'លុប',
        'delete_confirm' => 'តើអ្នកប្រាកដទេថាអ្នកចង់លុបក្រុមនេះ?',
    ],

    'create' => [
        'title' => 'បន្ថែមក្រុមភារកិច្ច',
    ],

    'form' => [
        'name' => 'ឈ្មោះក្រុម',
        'active' => 'សកម្ម',
    ],

    'edit' => [
        'title' => 'កែប្រែក្រុមភារកិច្ច',
    ],

    'controller' => [
        'index' => [
            'title' => 'ក្រុមភារកិច្ចសកម្ម | ផ្ទៃតាប្លូប្រចាំថ្ងៃ',
        ],

        'create' => [
            'title' => 'បង្កើតក្រុមភារកិច្ច | ផ្ទៃតាប្លូប្រចាំថ្ងៃ',
            'success_add' => 'ក្រុមភារកិច្ចត្រូវបានបង្កើតដោយជោគជ័យ។',
        ],

        'show' => [
            'title' => 'ក្រុមភារកិច្ចសកម្ម | ផ្ទៃតាប្លូប្រចាំថ្ងៃ',
        ],

        'edit' => [
            'title' => 'កែប្រែក្រុមភារកិច្ច | ផ្ទៃតាប្លូប្រចាំថ្ងៃ',
            'error_edit' => 'មិនអាចបិទភារកិច្ចទាំងអស់បានទេ។ ភារកិច្ចយ៉ាងហោចណាស់មួយត្រូវតែនៅសកម្ម។',
            'success_edit' => 'ក្រុមភារកិច្ចត្រូវបានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ។',
        ],

        'delete' => [
            'error_delete' => 'ក្រុមភារកិច្ចសកម្មមិនអាចលុបបានទេ។',
            'success_delete' => 'ទិន្នន័យក្រុមភារកិច្ចត្រូវបានលុបដោយជោគជ័យ។',
        ],
    ]
];