<?php

return [
    'title' => 'ប្រវត្តិពិន្ទុប្រចាំថ្ងៃ',

    'filter' => [
        'start_date' => 'កាលបរិច្ឆេទចាប់ផ្តើម',
        'end_date' => 'កាលបរិច្ឆេទបញ្ចប់',
        'filter_button' => 'តម្រង',
        'reset_button' => 'កំណត់ឡើងវិញ',
    ],

    'table' => [
        'reporter_name' => 'ឈ្មោះអ្នករាយការណ៍',
        'report_type' => 'ប្រភេទរបាយការណ៍',
        'date' => 'កាលបរិច្ឆេទ',
        'description' => 'ការពិពណ៌នា',
        'media' => 'មេឌៀ',
        'member_name' => 'ឈ្មោះសមាជិក',
        'point' => 'ពិន្ទុ',
        'reply' => 'ការឆ្លើយតប',
        'waiting_reply' => 'កំពុងរង់ចាំការឆ្លើយតប',
        'empty' => 'គ្មានរបាយការណ៍ណាត្រូវបានរកឃើញទេ។',
    ],
];