<?php

return [
    'title' => 'ទំព័ររបាយការណ៍',

    'user_report' => 'របាយការណ៍អ្នកប្រើប្រាស់',
    'report_type' => 'ប្រភេទរបាយការណ៍',
    'report_select' => 'ជ្រើសរើសរបាយការណ៍',
    'description' => 'ការពិពណ៌នា',
    'photos' => 'រូបថត',
    'photos_help' => 'អ្នកអាចផ្ទុករូបថតច្រើនជាង 1 ឡើង។',
    'videos' => 'វីដេអូ',
    'videos_help' => 'អ្នកអាចផ្ទុកវីដេអូច្រើនជាង 1 ឡើង។',

    'members' => [
        'label' => 'សមាជិក',
        'name' => 'ឈ្មោះ',
        'add' => '+ បន្ថែមសមាជិក',
        'select_member' => 'ជ្រើសរើសសមាជិក',
        'remove' => 'លុប',
    ],

    'date' => 'ជ្រើសរើសកាលបរិច្ឆេទ',

    'buttons' => [
        'history' => 'ប្រវត្តិរបាយការណ៍',
    ],

    'errors' => [
        'description_required' => 'ការពិពណ៌នាត្រូវបានទាមទារ។',
    ],
];