<?php
return [
    'login'           => 'လော့ဂ်အင်',
    'add_member'      => '+ အသင်းဝင် ထည့်ပါ',
    'remove'          => 'ဖျက်ပါ',
    'submit'          => 'တင်သွင်းပါ',
    'back'            => 'နောက်သို့',
    'filter'          => 'စစ်ထုတ်ရန်',
    'reset'           => 'ပြန်လည်သတ်မှတ်ရန်',
    'export'          => 'တင်ပို့ရန်',
    'add'             => 'ထည့်ရန်',
    'edit'            => 'တည်းဖြတ်ရန်',
    'show'            => 'ပြရန်',
    'delete'          => 'ဖျက်ရန်',
    'reply'           => 'တုံ့ပြန်ရန်',
    'delete_confirm'  => 'သင်တကယ့်အားဖြင့် ဖျက်ချင်သလား?',
];
