<?php

return [
    'title' => 'ဆက်တင်များ',

    // Tabs
    'tabs' => [
        'roles' => 'အခန်းကဏ္ဍများ',
        'skills' => 'ကျွမ်းကျင်မှုများ',
        'report_types' => 'အစီရင်ခံစာအမျိုးအစားများ',
    ],

    // Form placeholders
    'placeholders' => [
        'role_name' => 'အခန်းကဏ္ဍအမည်',
        'skill_name' => 'ကျွမ်းကျင်မှုအမည်',
        'report_type_name' => 'အစီရင်ခံစာအမျိုးအစားအမည်',
    ],

    // Buttons
    'buttons' => [
        'add' => 'ထည့်သွင်းရန်',
        'delete' => 'ဖျက်ရန်',
    ],

    // Confirmation
    'confirm' => [
        'delete_role' => 'ဤအခန်းကဏ္ဍကိုဖျက်မည်မှာသေချာပါသလား။',
        'delete_skill' => 'ဤကျွမ်းကျင်မှုကိုဖျက်မည်မှာသေချာပါသလား။',
        'delete_report_type' => 'ဤအစီရင်ခံစာအမျိုးအစားကိုဖျက်မည်မှာသေချာပါသလား။',
    ],

    'controller' => [
        'index' => [
            'title' => 'တန်ဖိုးထည့်သွင်းရန် | ဒိုင်ခြင်းဘုတ်',
        ],

        'create' => [
            'success_add_role' => 'အခန်းကဏ္ဍကိုအောင်မြင်စွာထည့်သွင်းပြီးပါပြီ',
            'success_add_skill' => 'ကျွမ်းကျင်မှုကိုအောင်မြင်စွာထည့်သွင်းပြီးပါပြီ',
            'success_add_report' => 'အစီရင်ခံစာအမျိုးအစားကိုအောင်မြင်စွာထည့်သွင်းပြီးပါပြီ',
        ],

        'delete' => [
            'success_delete_role' => 'အခန်းကဏ္ဍကိုအောင်မြင်စွာဖျက်ပြီးပါပြီ',
            'success_delete_skills' => 'ကျွမ်းကျင်မှုကိုအောင်မြင်စွာဖျက်ပြီးပါပြီ',
            'success_delete_report' => 'အစီရင်ခံစာအမျိုးအစားကိုအောင်မြင်စွာဖျက်ပြီးပါပြီ',
        ],
    ]
];