<?php

return [
    'index' => [
        'title'  => '📊 ဒေတာဖော်မြူလာ',

        'table' => [
            'building'     => 'အဆောက်အဦး',
            'member'       => 'အဖွဲ့ဝင်',
            'oa'           => 'OA',
            'ov'           => 'OV',
            'stay'         => 'နေထိုင်ခြင်း',
            'vec'          => 'Vec',
            'premier'      => 'Premier',
            'action'       => 'လုပ်ဆောင်ချက်',
        ],
    ],
    'create' => [
        'title'                 => 'ဖော်မြူလာထည့်သွင်းရန်',
    ],

    'form' => [
        'building_label'        => 'အဆောက်အဦးအမည်',
        'building_placeholder'  => 'အဆောက်အဦးကိုရွေးချယ်ပါ',
        'member_label'          => "အဖွဲ့ဝင်အရေအတွက် (နံပါတ် သို့မဟုတ် 'ကျပန်း')",
        'oa_label'              => 'OA',
        'ov_label'              => 'OV',
        'stay_label'            => 'နေထိုင်ခြင်း',
        'vec_label'             => 'Vec',
        'premier_label'         => 'Premier',
    ],
    'edit' => [
        'title'                 => 'ဖော်မြူလာတည်းဖြတ်ရန်',
    ],
    'show' => [
        'title'          => 'ဖော်မြူလာအသေးစိတ်',
        'building_name'  => 'အဆောက်အဦးအမည်',
        'member_count'   => 'အဖွဲ့ဝင်အရေအတွက်',
        'oa'             => 'OA',
        'ov'             => 'OV',
        'stay'           => 'နေထိုင်ခြင်း',
        'vec'            => 'Vec',
        'premier'        => 'Premier',
    ],
    'controller' => [
        'index' => [
            'title' => 'ဒေတာဖော်မြူလာ | ဒိုင်ခြင်းဘုတ်',
        ],
        'create' => [
            'title' => 'ဖော်မြူလာထည့်သွင်းရန် | ဒိုင်ခြင်းဘုတ်',
            'success_add'      => 'ဖော်မြူလာကိုအောင်မြင်စွာထည့်သွင်းပြီးပါပြီ!',
        ],
        'edit' => [
            'title' => 'ဖော်မြူလာတည်းဖြတ်ရန် | ဒိုင်ခြင်းဘုတ်',
            'success_update'   => 'ဖော်မြူလာကိုအောင်မြင်စွာအပ်ဒိတ်လုပ်ပြီးပါပြီ!',
        ],
        'show' => [
            'title' => 'ဖော်မြူလာအသေးစိတ် | ဒိုင်ခြင်းဘုတ်',
        ],
        'delete' => [
            'title' => '',
            'success_delete'   => 'ဖော်မြူလာကိုအောင်မြင်စွာဖျက်ပြီးပါပြီ!',
        ],
        'validation' => [
            'building_slug_required' => 'အဆောက်အဦးဆလပ်ကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'member_count_required'  => 'အဖွဲ့ဝင်အရေအတွက်ကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'oa_required'            => 'OAတန်ဖိုးကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'ov_required'            => 'OVတန်ဖိုးကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'stay_required'          => 'နေထိုင်ခြင်းတန်ဖိုးကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'vec_required'           => 'Vecတန်ဖိုးကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'premier_numeric'        => 'Premierတန်ဖိုးသည်နံပါတ်ဖြစ်ရမည်။',
        ],
    ],
];
