<?php

return [
    'index' => [
        'title' => 'ရုံးတာဝန်များ',
    ],

    'table' => [
        'name' => 'အုဖွဲ့အမည်',
        'status' => 'အခြေအနေ',
        'action' => 'လုပ်ဆောင်ချက်',
        'active' => 'တက်ကြွ',
        'inactive' => 'အိပ်စက်',
        'show' => 'ကြည့်ရန်',
        'edit' => 'ပြင်ဆင်ရန်',
        'delete' => 'ဖျက်ရန်',
        'delete_confirm' => 'ဤအုဖွဲ့ကိုဖျက်ရန်သေချာပါသလား။',
    ],

    'create' => [
        'title' => 'တာဝန်အုဖွဲ့ထည့်သွင်းရန်',
    ],

    'form' => [
        'name' => 'အုဖွဲ့အမည်',
        'active' => 'တက်ကြွ',
    ],

    'edit' => [
        'title' => 'တာဝန်အုဖွဲ့ပြင်ဆင်ရန်',
    ],

    'controller' => [
        'index' => [
            'title' => 'တက်ကြွသောတာဝန်အုဖွဲ့များ | ဒိုင်ခြင်းဘုတ်',
        ],

        'create' => [
            'title' => 'တာဝန်အုဖွဲ့ဖန်တီးရန် | ဒိုင်ခြင်းဘုတ်',
            'success_add' => 'တာဝန်အုဖွဲ့ကိုအောင်မြင်စွာဖန်တီးပြီးပါပြီ။',
        ],

        'show' => [
            'title' => 'တက်ကြွသောတာဝန်အုဖွဲ့များ | ဒိုင်ခြင်းဘုတ်',
        ],

        'edit' => [
            'title' => 'တာဝန်အုဖွဲ့ပြင်ဆင်ရန် | ဒိုင်ခြင်းဘုတ်',
            'error_edit' => 'တာဝန်အားလုံးကိုပိတ်၍မရပါ။ အနည်းဆုံးတာဝန်တစ်ခုသည်တက်ကြွနေရပါမည်။',
            'success_edit' => 'တာဝန်အုဖွဲ့ကိုအောင်မြင်စွာအပ်ဒိတ်လုပ်ပြီးပါပြီ။',
        ],

        'delete' => [
            'error_delete' => 'တက်ကြွသောတာဝန်အုဖွဲ့ကိုဖျက်၍မရပါ။',
            'success_delete' => 'တာဝန်အုဖွဲ့ဒေတာကိုအောင်မြင်စွာဖျက်ပြီးပါပြီ။',
        ],
    ]
];