<?php

return [
    'index' => [
        'title' => 'ဖော်မြူလာစာရင်း',

        'table' => [
            'name'           => 'ဖော်မြူလာအမည်',
            'description'    => 'ဖော်ပြချက်',
            'status'         => 'အခြေအနေ',
            'action'         => 'လုပ်ဆောင်ချက်',
            'active'         => 'တက်ကြွ',
            'inactive'       => 'အိပ်စက်',
            'delete_confirm' => 'ဤဖော်မြူလာကိုဖျက်ရန်သေချာပါသလား။',
        ],

    ],

    'form' => [
        'name'                => 'ဖော်မြူလာအမည်',
        'description'         => 'ဖော်ပြချက်',
        'active'              => 'တက်ကြွ',
        'jumlah_kamar'        => 'အခန်းအရေအတွက်',
        'mengajar'            => 'သင်ကြားခြင်း',
        'pembersihan_khusus'  => 'အထူးသန့်ရှင်းရေး',
        'mengangkat_barang'   => 'ပစ္စည်းများကိုယူဆောင်ခြင်း',
        'membersihkan_gudang' => 'ဂိုဒေါင်သန့်ရှင်းရေး',
        'obat_pool'           => 'ရေကန်ဆေးပစ္စည်း',
        'membersihkan_pool'   => 'ရေကန်သန့်ရှင်းရေး',
        'sampah'              => 'အကုန်သုံးပစ္စည်းများ',
    ],

    'create' => [
        'title' => 'ဖော်မြူလာစစ်ဆေးခြင်းထည့်သွင်းရန်',
    ],

    'edit' => [
        'title' => 'ဖော်မြူလာစစ်ဆေးခြင်းတည်းဖြတ်ရန်',
    ],

    'show' => [
        'title' => 'ဖော်မြူလာစစ်ဆေးခြင်းအသေးစိတ်',
    ],

    'controller' => [
        'index' => [
            'title' => 'ဖော်မြူလာစစ်ဆေးခြင်း | ပင်မစာမျက်နှာ',
        ],

        'create' => [
            'title' => 'ဖော်မြူလာစစ်ဆေးခြင်းထည့်သွင်းရန် | ပင်မစာမျက်နှာ',
            'success_create' => 'ဖော်မြူလာကိုအောင်မြင်စွာထည့်သွင်းပြီးပါပြီ။',
        ],

        'show' => [
            'title' => 'ဖော်မြူလာစစ်ဆေးခြင်းအသေးစိတ် | ပင်မစာမျက်နှာ',
        ],

        'edit' => [
            'title' => 'ဖော်မြူလာစစ်ဆေးခြင်းတည်းဖြတ်ရန် | ပင်မစာမျက်နှာ',
            'error_edit' => 'အနည်းဆုံးဖော်မြူလာတစ်ခုသည်တက်ကြွနေရပါမည်။',
            'success_edit' => 'ဖော်မြူလာကိုအောင်မြင်စွာအပ်ဒိတ်လုပ်ပြီးပါပြီ။',
        ],

        'delete' => [
            'error_delete' => 'တက်ကြွနေသေးသည့်ဖော်မြူလာကိုဖျက်၍မရပါ။',
            'success_delete' => 'ဖော်မြူလာဒေတာကိုအောင်မြင်စွာဖျက်ပြီးပါပြီ။',
        ],

        'validation' => [
            'name.required' => 'အမည်ကွက်လပ်ကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'name.string'   => 'အမည်သည်စာသားဖြစ်ရမည်။',
            'name.max'      => 'အမည်သည် ၂၅၅ စာလုံးထက်မကျော်ရပါ။',

            'description.required' => 'ဖော်ပြချက်ကွက်လပ်ကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'description.string'   => 'ဖော်ပြချက်သည်စာသားဖြစ်ရမည်။',

            'jumlah_kamar.required' => 'အခန်းအရေအတွက်ကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'jumlah_kamar.numeric'  => 'အခန်းအရေအတွက်သည်နံပါတ်ဖြစ်ရမည်။',

            'mengajar.required' => 'သင်ကြားခြင်းတန်ဖိုးကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'mengajar.numeric'  => 'သင်ကြားခြင်းတန်ဖိုးသည်နံပါတ်ဖြစ်ရမည်။',

            'pembersihan_khusus.required' => 'အထူးသန့်ရှင်းရေးတန်ဖိုးကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'pembersihan_khusus.numeric'  => 'အထူးသန့်ရှင်းရေးတန်ဖိုးသည်နံပါတ်ဖြစ်ရမည်။',

            'mengangkat_barang.required' => 'ပစ္စည်းများကိုယူဆောင်ခြင်းတန်ဖိုးကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'mengangkat_barang.numeric'  => 'ပစ္စည်းများကိုယူဆောင်ခြင်းတန်ဖိုးသည်နံပါတ်ဖြစ်ရမည်။',

            'membersihkan_gudang.required' => 'ဂိုဒေါင်သန့်ရှင်းရေးတန်ဖိုးကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'membersihkan_gudang.numeric'  => 'ဂိုဒေါင်သန့်ရှင်းရေးတန်ဖိုးသည်နံပါတ်ဖြစ်ရမည်။',

            'obat_pool.required' => 'ရေကန်ဆေးပစ္စည်းတန်ဖိုးကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'obat_pool.numeric'  => 'ရေကန်ဆေးပစ္စည်းတန်ဖိုးသည်နံပါတ်ဖြစ်ရမည်။',

            'membersihkan_pool.required' => 'ရေကန်သန့်ရှင်းရေးတန်ဖိုးကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'membersihkan_pool.numeric'  => 'ရေကန်သန့်ရှင်းရေးတန်ဖိုးသည်နံပါတ်ဖြစ်ရမည်။',

            'sampah.required' => 'အကုန်သုံးပစ္စည်းများတန်ဖိုးကိုဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
            'sampah.numeric'  => 'အကုန်သုံးပစ္စည်းများတန်ဖိုးသည်နံပါတ်ဖြစ်ရမည်။',
        ]
    ],

];