<?php

return [
    'index' => [
        'title'  => '📋 အဆောက်အဦး ဒေတာ',
        'table' => [
            'photo'        => 'ဓာတ်ပုံ',
            'name'         => 'အမည်',
            'description'  => 'ဖေါ်ပြချက်',
            'action'       => 'လုပ်ဆောင်ချက်',
            'edit'         => 'တည်းဖြတ်ရန်',
        ],
    ],

    'form' => [
        'building_image'      => 'အဆောက်အဦး ဓာတ်ပုံ',
        'image_hint'          => 'ဓာတ်ပုံကို နှိပ်ပြီး ပြောင်းပါ',
        'image_upload'        => 'ဖိုင် အပ်လုဒ်',
        'upload_hint'         => 'SVG, PNG, JPG သို့မဟုတ် GIF (အချိုး 1:1)',
        'building_name'       => 'အဆောက်အဦး အမည်',
        'description'         => 'ဖေါ်ပြချက်',
    ],

    'create' => [
        'title'               => 'အဆောက်အဦး ထည့်ပါ',
    ],

    'edit' => [
        'title'               => 'အဆောက်အဦး တည်းဖြတ်ရန်',
    ],
    'controller' => [
        'index' => [
            'title'   => 'အဆောက်အဦး စာမျက်နှာ | ဒက်ရှ်ဘုတ်',
        ],
        'create' => [
            'title'   => 'အဆောက်အဦး ထည့်ပါ | ဒက်ရှ်ဘုတ်',
            'success_add'   => 'အဆောက်အဦးကို အောင်မြင်စွာ ထည့်ပြီးပါပြီ!',
        ],
        'show' => [
            'title'   => 'အဆောက်အဦး အသေးစိတ် | ဒက်ရှ်ဘုတ်',
        ],
        'edit' => [
            'title'   => 'အဆောက်အဦး တည်းဖြတ်ရန် | ဒက်ရှ်ဘုတ်',
            'success_update' => 'အဆောက်အဦးကို အောင်မြင်စွာ အပ်ဒိတ်လုပ်ပြီးပါပြီ!',
        ],
        'delete' => [
            'success_delete' => 'အဆောက်အဦး ဒေတာကို ဖျက်ပြီးပါပြီ!',
        ],

        'validation' => [
            'building_name_required' => 'အဆောက်အဦးအမည် ထည့်ရန် လိုအပ်သည်။',
            'slug_required'          => 'Slug ထည့်ရန် လိုအပ်သည်။',
            'slug_unique'            => 'Slug ကို အသုံးပြုပြီးသားဖြစ်သည်။',
            'description_required'   => 'ဖေါ်ပြချက် ထည့်ရန် လိုအပ်သည်။',
            'photo_image'            => 'တင်သွင်းထားသော ဖိုင်သည် ဓာတ်ပုံဖြစ်ရမည်။',
            'photo_mimes'            => 'ဓာတ်ပုံသည် jpeg, png, jpg သို့မဟုတ် gif ပုံစံဖြစ်ရမည်။',
            'photo_max'              => 'ဓာတ်ပုံအရွယ်အစားသည် 2MB ကျော်မသင့်ပါ။',
        ],
    ]

];
