<?php

return [
    'title' => 'အစီရင်ခံစာဒိုင်ခြင်းဘုတ်',

    'table' => [
        'reporter_name' => 'အစီရင်ခံသူအမည်',
        'report_type'   => 'အစီရင်ခံစာအမျိုးအစား',
        'date'          => 'ရက်စွဲ',
        'description'   => 'ဖော်ပြချက်',
        'media'         => 'မီဒီယာ',
        'member_name'   => 'အဖွဲ့ဝင်အမည်',
        'point'         => 'အမှတ်',
        'action'        => 'လုပ်ဆောင်ချက်',
        'no_data'       => 'ရရှိနိုင်သောအစီရင်ခံစာမရှိပါ။',
    ],

    'form' => [
        'reply_placeholder' => 'ပြန်ကြားချက်ရေးပါ...',
        'point_placeholder' => 'အမှတ်',
    ],

    'controller' => [
        'index' => [
            'title' => 'အစီရင်ခံစာဒေတာ | ဒိုင်ခြင်းဘုတ်',
        ],

        'reply' => [
            'success_reply' => 'ပြန်ကြားချက်နှင့်အမှတ်များကိုအောင်မြင်စွာပေးပြီးပါပြီ။',
        ]
    ]
];