<?php

return [
    'title' => 'အစီရင်ခံစာ ဒက်ရှ်ဘုတ်',
    'report_label' => 'အစီရင်ခံစာ အမျိုးအစား',
    'report_select' => 'အမျိုးအစား ရွေးချယ်ရန်',

    'table' => [
        'reporter_name' => 'အစီရင်ခံသူ အမည်',
        'report_type'   => 'အစီရင်ခံစာ အမျိုးအစား',
        'date'          => 'နေ့စွဲ',
        'description'   => 'ဖော်ပြချက်',
        'media'         => 'မီဒီယာ',
        'member_name'   => 'အဖွဲ့ဝင် အမည်',
        'point'         => 'အမှတ်',
        'action'        => 'လုပ်ဆောင်ချက်',
        'no_data'       => 'အစီရင်ခံစာ မရှိပါ။',
    ],

    'form' => [
        'reply_placeholder' => 'အကြောင်းပြန်ရေးရန်...',
        'point_placeholder' => 'အမှတ်',
    ],

    'controller' => [
        'index' => [
            'title' => 'အစီရင်ခံစာ ဒေတာ | ဒက်ရှ်ဘုတ်',
        ],

        'reply' => [
            'success_reply' => 'အကြောင်းပြန်ခြင်းနှင့် အမှတ်များကို အောင်မြင်စွာ ပေးထားပါသည်။',
        ]
    ]
];
