<?php

return [
    'show' => [
        'title' => '📋 ":name" အတွက်တာဝန်များ',
    ],

    'table' => [
        'task_name' => 'တာဝန်အမည်',
        'point'     => 'အမှတ်',
        'action'    => 'လုပ်ဆောင်ချက်',
    ],

    'form' => [
        'task_name'         => 'တာဝန်အမည်',
        'point'             => 'အမှတ်',
        'placeholder_point' => '0',
    ],

    'create' => [
        'title' => '":name" အတွက်တာဝန်ထည့်သွင်းရန်',
    ],

    'edit' => [
        'title' => 'တာဝန် ":name" ကိုတည်းဖြတ်ရန်',
    ],

    'controller' => [
        'create' => [
            'title'        => 'တာဝန်ထည့်သွင်းရန် | ဒိုင်ခြင်းဘုတ်',
            'success_add'  => 'တာဝန်ကိုအောင်မြင်စွာထည့်သွင်းပြီးပါပြီ။',
        ],

        'edit' => [
            'title'          => 'တာဝန်တည်းဖြတ်ရန် | ဒိုင်ခြင်းဘုတ်',
            'success_update' => 'တာဝန်ကိုအောင်မြင်စွာအပ်ဒိတ်လုပ်ပြီးပါပြီ။',
        ],

        'delete' => [
            'success_delete' => 'တာဝန်ကိုအောင်မြင်စွာဖျက်ပြီးပါပြီ။',
        ],
    ],

    'validation' => [
        'required' => 'ဤကွက်လပ်သည်ဖြည့်စွက်ရန်လိုအပ်ပါသည်။',
        'number'   => 'ကျေးဇူးပြု၍ တန်ဖိုးရှိသောနံပါတ်ကိုထည့်ပေးပါ။',
    ],
];