<?php

return [
    'title' => 'နေ့စဥ်အမှတ်သမုတ်မှု သမိုင်း',

    'filter' => [
        'start_date' => 'စတင်သည့်ရက်စွဲ',
        'end_date' => 'ပြီးဆုံးသည့်ရက်စွဲ',
        'filter_button' => 'စစ်ထုတ်ရန်',
        'reset_button' => 'ပြန်စသတ်မှတ်ပါ',
    ],

    'table' => [
        'reporter_name' => 'အစီရင်ခံသူအမည်',
        'report_type' => 'အစီရင်ခံစာအမျိုးအစား',
        'date' => 'ရက်စွဲ',
        'description' => 'ဖော်ပြချက်',
        'media' => 'မီဒီယာ',
        'member_name' => 'အဖွဲ့ဝင်အမည်',
        'point' => 'အမှတ်',
        'reply' => 'အဖြေပြန်ခြင်း',
        'waiting_reply' => 'အဖြေပြန်ရန်စောင့်နေပါသည်',
        'empty' => 'ရှာတွေ့သော အစီရင်ခံစာမရှိပါ။',
    ],
];